//////////将上三角填充到下三角上
////////#include<stdio.h>
////////int convert(int a[][3]);
////////int main(void)
////////{
////////	int i = 0, j = 0;
////////	int a[3][3];
////////	printf("请输入一个三阶的矩阵:\n");
////////	for(i=0;i<3;i++)
////////		for (j = 0; j < 3; j++)
////////		{
////////			scanf_s("%d", &a[i][j]);
////////		}
////////	convert(a);
////////	for (i = 0; i < 3; i++)
////////	{
////////		for (j = 0; j < 3; j++)
////////		{
////////			printf("%d\t", a[i][j]);
////////		}
////////		printf("\n");
////////	}
////////
////////}
////////int convert(int a[][3])
////////{
////////	int i, j;
////////	for(i=0;i<3;i++)
////////		for (j = 0; j < i; j++)
////////		{
////////			a[j][i] = a[i][j];
////////		}
////////	return a;
////////}
//////////将上三角填充到下三角上
//////#include<stdio.h>
//////void convert(int a[3][3]);
//////int main(void)
//////{
//////	int a[3][3];
//////	int i = 0, j = 0;
//////	printf("请输入一个三阶的矩阵:\n");
//////	for(i=0;i<3;i++)
//////		for (j = 0; j < 3; j++)
//////		{
//////			scanf_s("%d", &a[i][j]);
//////		}
//////	convert(a);
//////	for (i = 0; i < 3; i++)
//////	{
//////		for (j = 0; j < 3; j++)
//////		{
//////			printf("%d\t", a[i][j]);
//////		}printf("\n");
//////	}
//////}
//////void convert(int a[3][3])
//////{
//////	int i = 0, j = 0;
//////	for (i = 0; i < 3; i++) {
//////		for (j = 0; j < 3; j++) {
//////			a[j][i] = a[i][j];
//////		}
//////		
//////	}
//////}
/////*一个 4 * 4 数组 a 具有如下性质：数组元素 a[i][j]和 a[j][i]对应相等。编写
////程序，填充矩阵中的上三角部分的元素。
////输入格式 用 0 代替上三角部分的矩阵
////输出格式 完整的目标矩阵*/
////#include<stdio.h>
////int main(void)
////{
////	int a[4][4], i = 0, j = 0;
////	printf("请输入一个4*4的矩阵，上三角元素由0来替代:\n");
////	for (i = 0; i < 4; i++)
////	{
////		for (j = 0; j < 4; j++)
////			scanf_s("%d", &a[i][j]);
////	}
////	for (i = 0; i < 4; i++)
////	{
////		for (j = 0; j < i; j++)
////		{
////			a[j][i] = a[i][j];//注意在矩阵填充时两个值不要赋反了
////		}
////	}
////	for (i = 0; i < 4; i++)
////	{
////		for (j = 0; j < 4; j++)
////		{
////			printf("%d\t", a[i][j]);
////		}
////		printf("\n");
////	}
////}
/////*一个 4 * 4 数组 a 具有如下性质：数组元素 a[i][j]和 a[j][i]对应相等。编写
////程序，填充矩阵中的上三角部分的元素。
////输入格式 用 0 代替上三角部分的矩阵
////输出格式 完整的目标矩阵*/
//#include<stdio.h>
//void convert(int a[4][4]);
//int main(void)
//{
//	int a[4][4], i, j = 0;
//	printf("请输入矩阵的元素,上三角的元素由0来替代:\n");
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			scanf_s("%d", &a[i][j]);
//		}
//	}
//	convert(a);
//	printf("转换后:\n");
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d\t", a[i][j]);
//		}
//		printf("\n");
//	}
//
//}
//void convert(int a[4][4])
//{
//	int i = 0, j = 0;
//	for (i = 0; i < 4; i++)
//	{
//		for (j = 0; j < i; j++)
//		{
//			a[j][i] = a[i][j];
//		}
//	}
//}